# ProjectionPlanesParallel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..ProjectionPlanesParallel Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Can't project Analytical Model. Two or more projection planes are parallel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProjectionPlanesParallel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProjectionPlanesParallel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProjectionPlanesParallel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace